# IFCHybrid Import Import Elements(Document, String, IFCHybrid Import Options) Method

Source: https://www.revitapidocs.com/2026/63776046-0d92-771d-a123-615c33bd62c5.htm

---

| IFCHybrid Import Import Elements(Document, String, IFCHybrid Import Options) Method |
| --- |

Imports IFC Elements using AnyCAD.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> ImportElements(
	Document doc,
	string file,
	IFCHybridImportOptions options
)
```

```
Public Function ImportElements (
	doc As Document,
	file As String,
	options As IFCHybridImportOptions
) As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ ImportElements(
	Document^ doc,
	String^ file,
	IFCHybridImportOptions^ options
)
```

```
member ImportElements :
        doc : Document *
        file : string *
        options : IFCHybridImportOptions -> IList<ElementId>
```

#### Parameters

doc Document
:   Document to receive elements from the IFC file import.

file String
:   Full path of the file to import.

options IFCHybridImportOptions
:   The hybrid import options.

#### Return Value

IList ElementId
Returns an array of ElementIds representing created elements. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCHybridImport Class ImportElements Overload Autodesk.Revit.DB.IFC Namespace